# -------------------------
# Terminal and session management
# -------------------------
cask "kitty"                 # fast GPU-based terminal
brew "tmux"                  # terminal multiplexer (session manager)

# -------------------------
# CLI utilities and tools
# -------------------------
brew "tldr"                  # simplified man pages
brew "yazi"                  # file manager (alternative to mc)
brew "btop"                  # system monitor (alternative to top)
brew "zoxide"                # smarter cd command
brew "bat"                   # enhanced cat with syntax highlighting
brew "ripgrep"               # fast text search (rg)
brew "fd"                    # simple and fast file finder
brew "jq"                    # JSON parser
brew "yq"                    # YAML/XML parser
brew "wget"                  # file downloader
brew "curl"                  # HTTP client
brew "gnupg"                 # encryption and signing tool (gpg)

# -------------------------
# Search and navigation
# -------------------------
brew "fzf"                   # fuzzy finder

# -------------------------
# GitHub and DevOps
# -------------------------
brew "gh"                    # GitHub CLI
brew "act"                   # run GitHub Actions locally

# -------------------------
# Virtualization and containers
# -------------------------
cask "utm"                   # virtualization for macOS
brew "docker"                # container platform
brew "docker-compose"        # container orchestration
brew "dive"                  # Docker image inspector
brew "trivy"                 # container vulnerability scanner

# -------------------------
# Kubernetes
# -------------------------
brew "kind"                  # local Kubernetes in Docker
brew "k3d"                   # lightweight local Kubernetes
brew "kubectl"               # Kubernetes CLI
brew "helm"                  # Kubernetes package manager
brew "kubectx"               # switch between Kubernetes contexts
brew "k9s"                   # terminal-based Kubernetes IDE
cask "lens"                  # GUI-based Kubernetes IDE
brew "stern"                 # tail logs from multiple Kubernetes pods

# -------------------------
# Infrastructure as Code and automation
# -------------------------
brew "terraform"             # infrastructure as code
brew "ansible"               # automation and configuration management

# -------------------------
# Databases
# -------------------------
cask "mongodb-compass"       # MongoDB GUI client
brew "mongosh"               # MongoDB shell
cask "dbeaver-community"     # universal SQL database IDE

# -------------------------
# HTTP and API
# -------------------------
brew "httpie"                # user-friendly HTTP client

# -------------------------
# Security and VPN
# -------------------------
brew "openvpn"               # VPN client
cask "clearvpn"              # VPN client

# -------------------------
# System utilities
# -------------------------
cask "transmission"          # BitTorrent client
cask "app-cleaner"           # application uninstaller
cask "shottr"                # screenshot tool
cask "keepingyouawake"       # prevent macOS from sleeping
cask "keka"                  # file archiver
cask "bitwarden"             # password manager

# -------------------------
# Communication
# -------------------------
cask "telegram"              # messenger
cask "signal"                # messenger

# -------------------------
# Productivity and media
# -------------------------
cask "notion"                # notes and organization
cask "spotify"               # music player
cask "youtube-music"         # music player (YouTube Music)
cask "google-drive"          # cloud storage

# -------------------------
# AI tools
# -------------------------
cask "chatgpt"               # ChatGPT client
cask "claude"                # Claude AI client
cask "gemini"                # Google Gemini client
brew "gemini-cli"            # Google Gemini CLI tool
cask "cursor"                # AI-powered IDE

# -------------------------
# UI and environment
# -------------------------
cask "alt-tab"               # window switcher
cask "brave-browser"         # web browser
brew "brew-browser"          # browse Homebrew formulas and casks
cask "visual-studio-code"    # code editor
cask "sublime-text"          # text editor
cask "raycast"               # productivity launcher
brew "starship"              # modern shell prompt
cask "font-jetbrains-mono-nerd-font"  # developer font with icons
cask "font-fira-code-nerd-font"  # developer font with icons
cask "karabiner-elements"    # keyboard customization tool
cask "jordanbaird-ice"       # menu bar icon manager for macOS
